export const cards = [
  {
    id: 0,
    img: "https://i.ibb.co/mbwDrTy/Group-231.jpg",
    title: "Скидка -15% на групповой заказ",
    data: "1.01.21",
    subTitle:
      "Получите скидку -15% при оформлении группового заказа в период с 1 января 2021 г. по 19 февраля 2021 г.Используйте промокод январь15 при оформлении заказа.",
    tag: "акции и спец. предложения",
  },
  {
    id: 1,
    img: "https://i.ibb.co/mbwDrTy/Group-231.jpg",
    title: "Скидка -15% на групповой заказ",
    data: "1.01.21",
    subTitle:
      "Получите скидку -15% при оформлении группового заказа в период с 1 января 2021 г. по 19 февраля 2021 г.Используйте промокод январь15 при оформлении заказа.",
    tag: "акции и спец. предложения",
  },
  {
    id: 2,
    img: "https://i.ibb.co/mbwDrTy/Group-231.jpg",
    title: "Скидка -15% на групповой заказ",
    data: "1.01.21",
    subTitle:
      "Получите скидку -15% при оформлении группового заказа в период с 1 января 2021 г. по 19 февраля 2021 г.Используйте промокод январь15 при оформлении заказа.",
    tag: "рахматшо",
  },
  {
    id: 3,
    img: "https://i.ibb.co/mbwDrTy/Group-231.jpg",
    title: "Скидка -15% на групповой заказ",
    data: "1.01.21",
    subTitle:
      "Получите скидку -15% при оформлении группового заказа в период с 1 января 2021 г. по 19 февраля 2021 г.Используйте промокод январь15 при оформлении заказа.",
    tag: "диана",
  },
  {
    id: 4,
    img: "https://finsoft.ua/files/uploads/Flydoc/Flydo%D1%81_50_1.jpg",
    title:
      "25го января состоится ярмарка на которой все товары можно купить по 50% скидке.",
    data: "03.01.21",
    subTitle:
      "А также для наших постоянных покупателей есть 65% скидка по прокомоду - Pchelka ! ",
    tag: "Новости",
  },
  {
    id: 5,
    img: "https://www.goodnewsfinland.com/dam/jcr:21869ba0-942b-4be5-81fc-e5b663a32027/event-management_2000x1125-1076535.jpeg",
    title:
      "1 февраля состоится мероприятие в честь дня открытия нашего магазина.",
    data: "14.01.21",
    subTitle:
      "Приглашаем всех наших клиентов посетить празднование нашего юбилейа",
    tag: "Новости",
  },
  {
    id: 6,
    img: "https://media.istockphoto.com/id/1281067367/ru/%D1%84%D0%BE%D1%82%D0%BE/%D1%82%D0%B5%D0%B3-%D0%BF%D1%80%D0%BE%D0%B4%D0%B0%D0%B6%D0%B8-%D1%81-%D1%87%D0%B5%D1%80%D0%BD%D0%BE%D0%B9-%D0%BF%D1%8F%D1%82%D0%BD%D0%B8%D1%86%D0%B5%D0%B9-%D0%BD%D0%B0%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%BD%D1%8B%D0%B9-%D0%BD%D0%B0-%D0%B6%D0%B5%D0%BB%D1%82%D0%BE%D0%BC-%D1%84%D0%BE%D0%BD%D0%B5.jpg?s=612x612&w=0&k=20&c=pn4wZgSAPvgS-0q0sjY0cyMN6PvbxBeI-uKkcCsrgNE=",
    title:
      "В честь черной пятницы который уже совсем скоро, на все товары действует 70% скидка",
    data: "13.09.22",
    subTitle:
      "Чтобы использовать эту приятную возможность вам нужно зарегистрироваться на нашем сайте !",
    tag: "Новости",
  },
  {
    id: 7,
    img: "https://img.freepik.com/premium-vector/world-children-s-day-celebration-background-banner-card-cartoon-illustration-flat-cartoon-style_422763-851.jpg?w=2000",
    title:
      "Хотим вас поздравить с днем защиты детей и объявляем конкурс ,подробную информацию можете получить на нашем инстаграм аккаунте",
    data: "30.05.21",
    subTitle: "Отличная возможность порадовать ваших детей ",
    tag: "Новости",
  },
];
